Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_Framework_Swift/Framework_Swift-level2_source1.tmx
Source language: en_us
Languages: ja

source: When you use arrays, dictionaries, and other collections, you benefit from the operations that the Collection protocol declares and implements.
ja: あなたが配列、辞書、および他のコレクションを使うとき、あなたはCollectionプロトコルが宣言および実装する演算からの恩恵を受けます。

source: When you want to sort a collection of elements that don’t conform to the Comparable protocol, pass a closure to this method that returns true when the first element should be ordered before the second.
ja: あなたがComparableプロトコルに準拠しない要素からなるコレクションをソートしたい場合、最初の要素が２番目の前に並べられるべき場合はtrueを返すクロージャをこのメソッドに渡してください。

source: When you want to sort a sequence of elements that don’t conform to the Comparable protocol, pass a predicate to this method that returns true when the first element should be ordered before the second.
ja: あなたがComparableプロトコルに準拠しない要素からなるシーケンスをソートしたい場合、最初の要素が２番目の前に並べられるべき時はtrueを返す述部をこのメソッドに渡してください。

source: When you work with objects of type Any where you know the underlying type, it's often useful to downcast those objects to the underlying type.
ja: あなたが基盤型を知っているところの型Anyのオブジェクトを扱う場合、しばしば役立つのはそれらオブジェクトを基盤型へとダウンキャストすることです。

source: When you're building an app target, you can import your Swift code into any Objective-C .m file within that same target using this syntax and substituting the appropriate name:
ja: あなたがアプリターゲットをビルドしている場合、あなたはあなたのSwiftコードをインポートすることが、あらゆるObjective-C .mファイルへと、その同じターゲット内で、この構文を使ってそして適切な名前を代わりに使って、行えます。

source: When you're choosing how to model your data, try building the hierarchy of data types using protocol inheritance first, then adopt those protocols in your structures.
ja: あなたのデータをモデル化する方法をあなたが選ぶ時、データ型の階層の構築を最初にプロトコル継承を使って試みてください、それからそれらのプロトコルをあなたの構造体において採用してください。

source: When you’ve finished feeding the hasher, the hash value can be retrieved by calling finalize():
ja: あなたがハーシャーに入力を完了する時、ハッシュ値はfinalize()を呼び出すことで取り出せます：

source: Whenever possible, Swift avoids giving you direct access to pointers.
ja: 可能なときはいつでも、スウィフトはあなたにポインターへの直接のアクセスを与えることを避けます。

source: Whenever possible, Swift’s compiler infers the full intended type of your array literal.
ja: 可能な時はいつでも、Swiftのコンパイラはあなたの配列リテラルの完全な意図される型を推論します。

source: Where conversion using as or as? is possible between two types (such as Int and NSNumber), AnyHashable uses a canonical representation of the type-erased value so that instances wrapping the same value of either type compare as equal.
ja: asまたはas?を使う変換が、２つの型の間（たとえばIntとNSNumber）で可能であるところでは、AnyHashableはその型消去値のある正準表現を使います、それでどちらかの型での同じ値をラップしているインスタンスそれらは等しいとみなされます。

source: Where in some languages you might pass a starting index into an indexOf method to find the second day, in Swift you perform the same operation on a slice of the original array.
ja: 何らかの言語ではあなたはある開始インデックスをindexOfメソッドに渡して２つ目の日付を見つけるかもしれないところで、Swiftではあなたは同じ演算をオリジナル配列のスライス上で実行します。

source: Wherever memory management annotations are provided, Swift automatically manages the memory of Core Foundation objects, including Core Foundation objects that you instantiate yourself.
ja: メモリ管理注釈が提供されるどこででも、あなた自身でインスタンス化するCore Foundationオブジェクトを含めて、スウィフトは自動的にCore Foundationオブジェクトのメモリを管理します。

source: Whether the dictionary should keep its underlying buffer.
ja: 辞書がそれの基礎をなすバッファを保つべきかどうか。

source: Whichever of x or y has greater magnitude, or whichever is a number if the other is NaN.
ja: xとyのどちらがより大きい規模を持つか、または他方がNaNならば数である方。

source: Whichever of x or y has lesser magnitude, or whichever is a number if the other is NaN.
ja: xとyのどちらがより小さい規模を持つか、または他方がNaNならば数である方。

source: While the resulting array may have a capacity larger than the requested amount, the buffer passed to the closure will cover exactly the requested number of elements.
ja: 結果配列が要請された量より大きい収容能力を持つかもしれない一方で、クロージャに渡されるバッファは、正確に要請された数の要素に及びます。

source: While this example isn’t itself asychronous, it shows the shape of a custom sequence and iterator, and how to use it as if it were asynchronous:
ja: この例はそれ自体は非同期でない一方で、それはあるあつらえのシーケンスとイテレータの輪郭、そしてまるでそれが非同期だったかのようにそれを使う方法を示します：

source: With Equatable conformance, you can use the equal-to operator (==) or the not-equal-to operator (!=) with any two instances of the Position type.
ja: Equatable準拠で、あなたは同等演算子（==）または不等演算子（!=）をPosition型の任意の２つのインスタンスで使用できます。

source: With either function, you pass the resulting CVaListPointer value as the va_list argument of the C variadic function.
ja: どちらの関数でも、あなたは結果のCVaListPointer値を、C可変長引数関数のva_list引数として渡します。

source: With pointer p and distance n, the result of p.advanced(by: n) is equivalent to p + n.
ja: ポインタpと隔たりnでは、p.advanced(by: n)の結果はp + nと同等です。

source: With pointers p and q, the result of p.distance(to: q) is equivalent to q - p.
ja: ポインタpとqでは、p.distance(to: q)の結果はq - pと同等です。

source: With those elements defined, the inherited makeIterator() method satisfies the requirements of the Sequence protocol.
ja: 定義されるそれらの要素とともに、継承されるmakeIterator()メソッドがSequenceプロトコルの要件を満たします。

source: Within the execution of a Swift program, Hasher guarantees that finalizing it will always produce the same hash value as long as it is fed the exact same sequence of bytes.
ja: あるSwiftプログラムの実行の範囲内で、Hasherは、それをファイナライズすることは常に同じハッシュ値を生成することを、それが正確に同じバイト列を供給される限り保証します。

source: Without any other information, Swift creates an array that includes the specified values, automatically inferring the array’s Element type.
ja: 何らかの他の情報なしでは、Swiftは指定された値を含んでいる配列を、自動的にその配列のElement型を推論して作成します。

source: Work directly with memory-managed Core Foundation types in your Swift code, and manually handle retains as needed.
ja: メモリ管理されたCore Foundation型をあなたのSwiftコードにおいて直接に扱い、そして必要に応じて手動でリテインを処理します。

source: Working with Binary Representation
ja: バイナリ表現を扱う

source: Working with Byte Order
ja: バイト順を扱う

source: Working with Core Foundation Types
ja: Core Foundation型を扱う

source: Working with Foundation Types
ja: Foundation型を扱う

source: Working with Memory Addresses
ja: メモリアドレスを扱う

source: Working with a Character’s Unicode Values
ja: 文字のユニコード値を扱う

source: Wrappers for Algorithms
ja: アルゴリズムに対するラッパー

source: Writes a textual representation of this instance into the given output stream.
ja: このインスタンスのテキスト表現を与えられた出力ストリームへ書き出します。

source: Writes the character into the given output stream.
ja: その文字を与えられた出力ストリームへと書き出します。

source: Writes the textual representations of the given items into the given output stream.
ja: 与えられた要素のテキスト表現を与えられた出力ストリームに書き出します。

source: Writes the textual representations of the given items into the standard output.
ja: 与えられた項目のテキスト表現を標準出力に書き出します。

source: Writes the textual representations of the given items most suitable for debugging into the given output stream.
ja: 与えられた項目の、デバッグに最も適するテキスト表現を、与えられた出力ストリームに書き出します。

source: Writes the textual representations of the given items most suitable for debugging into the standard output.
ja: 与えられた項目の、デバッグに最も適するテキスト表現を、標準出力に書き出します。

source: Writing Swift code is interactive and fun in Swift Playgrounds, playgrounds in Xcode, and REPL.
ja: Swiftコード記述は、Swift Playgrounds、Xcodeのplaygrounds、およびREPLにおいて対話的で楽しいものとなります。

source: Writing is O(1) unless the array’s storage is shared with another array or uses a bridged NSArray instance as its storage, in which case writing is O(n), where n is the length of the array.
ja: 書き込みはO(1)です、配列のストレージが他の配列と共有するかブリッジされたNSArrayインスタンスをそれのストレージとして使うのでない限りは、その場合には書き込みはO(n)です、そこでnは配列の長さです。

source: Writing is O(1) unless the array’s storage is shared with another array, in which case writing is O(n), where n is the length of the array.
ja: 書き込みはO(1)です、配列のストレージが他の配列と共有されない限りは、その場合には書き込みはO(n)です、そこでnは配列の長さです。

source: Writing to a Text Stream
ja: テキストストリームを書き出す

source: Xcode offers to create this header when you add a Swift file to an existing Objective-C app, or an Objective-C file to an existing Swift app.
ja: Xcodeは、このヘッダファイルを作成することをあなたがSwiftファイルを既存のObjective-Cアプリに、またはObjective-Cファイルを既存のSwiftアプリに加える場合に提案します。

source: Xcode uses this name when naming the generated header file.
ja: Xcodeは、生成ヘッダファイルに名前を付けるときにこの名前を使います。

source: Yielding resulted in not buffering an element because the buffer was full.
ja: 生み出しはある要素をバッファしないという結果になりました、バッファが一杯だったため。

source: You access the number of cases and the cases themselves through CompassDirection.allCases.
ja: あなたは、ケース節の数およびケース節それ自体にアクセスすることがCompassDirection.allCasesを通して可能です。

source: You also use this method to sort elements that conform to the Comparable protocol in descending order.
ja: あなたはまた、このメソッドを使ってComparableプロトコルに準拠する要素を降順でソートすることができます。

source: You associate the property you want to observe with its observer by passing the object to the initializer of the observer:
ja: あなたは、あなたが監視を望むプロパティをそれのオブザーバと、オブジェクトをオブザーバのイニシャライザを渡すことによって結びつけます：

source: You can access a slice of a collection through its ranged subscript or by calling methods like prefix(while:) or suffix(_:).
ja: あなたは、あるコレクションのあるスライスにそれの範囲指定された添え字を通して、またはprefix(while:)またはsuffix(_:)のようなメソッドを呼び出すことによってアクセスできます。

source: You can access an element of a collection through its subscript by using any valid index except the collection’s endIndex property.
ja: あなたは、コレクションの要素にそれの添え字を通してアクセスすることが、そのコレクションのendIndexプロパティを除くあらゆる有効なインデックスを使って行えます。

source: You can access and use pieces of code written in C and Objective-C from within your Swift code.
ja: あなたは、CおよびObjective-Cで書かれるコードの断片にアクセスおよび利用することがあなたのSwiftコード内部から可能です。

source: You can access individual array elements through a subscript.
ja: あなたは個々の配列要素に添え字を通してアクセスすることができます。

source: You can add new elements in the middle of an array by using the insert(_:at:) method for single elements and by using insert(contentsOf:at:) to insert multiple elements from another collection or array literal.
ja: あなたは、新しい要素を配列の中ほどに追加することが、単一の項目にはinsert(_:at:)メソッドを使って、そして別のコレクションや配列リテラルから複数の項目を挿入するにはinsert(contentsOf:at:)を使って行えます。

source: You can also bridge some toll-free bridged Core Foundation types to Swift standard library types if you cast to a bridging Foundation type first.
ja: あなたはまた、いくつかのトールフリーブリッジされたCore Foundation型をSwift標準ライブラリ型にブリッジすることが、ブリッジしているFoundation型にあなたが最初にキャストするならば、可能です。

source: You can also invoke the retain(), release(), and autorelease() methods on unmanaged objects, but this approach is not recommended.
ja: あなたはまた、管理されないオブジェクト上でretain()、release()、そしてautorelease()メソッドを呼び出すことができます、しかしこの取り組みは勧められません。

source: You can also update, modify, or remove keys and values from a dictionary using the key-based subscript.
ja: あなたはまた、辞書のキーと値の更新、修正、または削除をキー基盤の添え字を使って可能です。

source: You can also use the do-catch statement to match on specific Cocoa error codes to differentiate possible failure conditions:
ja: あなたはまた、do-catch文を使って、特定のCocoaエラーコードそれらに関して照合して、可能な失敗状況を区別できます。

source: You can also use the CF_IMPLICIT_BRIDGING_ENABLED and CF_IMPLICIT_BRIDGING_DISABLED macros to enclose C function declarations that follow the policy for Core Foundation ownership naming, in order to infer memory management.
ja: あなたはまた、メモリ管理を推論する目的で、CF_IMPLICIT_BRIDGING_ENABLEDおよびCF_IMPLICIT_BRIDGING_DISABLEDマクロを使って、Core Foundation所有者命名の方針に従うC関数宣言を囲むことができます。

source: You can also use this initializer to convert a complex sequence or collection type back to an array.
ja: あなたはまたこのイニシャライザを使って、逆に複雑なシーケンスまたはコレクション型を配列へと変換することができます。

source: You can assign a dictionary literal to a variable or constant or pass it to a function that expects a dictionary.
ja: あなたは、辞書リテラルを変数や定数に代入したり、それを辞書を予期する関数に渡したりできます。

source: You can bridge between Dictionary and NSDictionary using the as operator.
ja: あなたは、DictionaryとNSDictionaryの間をブリッジすることがas演算子を使って行えます。

source: You can call any method on the slices that you might have called on the absences array.
ja: あなたはどんなメソッドでもそれらスライス上で呼び出すことができます、それはあなたがabsences配列上で呼び出すであろうものです。

source: You can check the equality of instances of any BinaryInteger types using the equal-to operator (==).
ja: あなたは、何らかのBinaryInteger型のインスタンスの同等性を同等演算子（==）使って確認できます。

source: You can check the inequality of instances of any BinaryInteger types using the not-equal-to operator (!=).
ja: あなたは、何らかのBinaryInteger型のインスタンスの不等性を不等演算子（!=）使って確認できます。

source: You can compare instances of an equatable type by using the equal-to (==) and not-equal-to (!=) operators.
ja: あなたは、equatable型のインスタンスを比較することが、同等（==）および不等（!=）演算子によって行えます。

source: You can compare instances of any BinaryInteger types using the greater-than operator (>), even if the two instances are of different types.
ja: あなたは、何らかのBinaryInteger型のインスタンスをより大きい演算子（>）を使って比較できます、２つのインスタンスが異なる型であるとしてもです。

source: You can compare instances of any BinaryInteger types using the greater-than-or-equal-to operator (>=), even if the two instances are of different types.
ja: あなたは、何らかのBinaryInteger型のインスタンスをより大きいか等しい演算子（>=）使って比較できます、２つのインスタンスが異なる型であるとしてもです。

source: You can compare instances of any BinaryInteger types using the less-than operator (<), even if the two instances are of different types.
ja: あなたは、何らかのBinaryInteger型のインスタンスをより小さい演算子（<）を使って比較できます、２つのインスタンスが異なる型であるとしてもです。

source: You can compare instances of any BinaryInteger types using the less-than-or-equal-to operator (<=), even if the two instances are of different types.
ja: あなたは、何らかのBinaryInteger型のインスタンスをより小さいか等しい演算子（<=）使って比較できます、２つのインスタンスが異なる型であるとしてもです。

source: You can confirm the data value’s underlying type by retrieving a non-nil value from doubleValue or by inspecting the type property.
ja: あなたは、データ値のもつ基礎をなす型を確認することが、非nil値をdoubleValueから回収することによって、またはtypeプロパティを調査することによって可能です。

source: You can confirm the data value’s underlying type by retrieving a non-nil value from intValue or by inspecting the type property.
ja: あなたは、データ値のもつ基礎をなす型を確認することが、非nil値をintValueから回収することによって、またはtypeプロパティを調査することによって可能です。

source: You can confirm the data value’s underlying type by retrieving a non-nil value from dictionaryValue or by inspecting the type property.
ja: あなたは、データ値のもつ基礎をなす型を確認することが、非nil値をdictionaryValueから回収することによって、またはtypeプロパティを調査することによって可能です。

source: You can confirm the data value’s underlying type by retrieving a non-nil value from sequenceValue or by inspecting the type property.
ja: あなたは、データ値のもつ基礎をなす型を確認することが、非nil値をsequenceValueから回収することによって、またはtypeプロパティを調査することによって可能です。

source: You can create a mirror for any type using the Mirror(reflecting:) initializer, but if you are not satisfied with the mirror supplied for your type by default, you can make it conform to CustomReflectable and return a custom Mirror instance.
ja: あなたは、任意の型に対してミラーを作成することがMirror(reflecting:)イニシャライザを使って可能です、しかしあなたの型に対して初期状態で提供されるミラーに満足しないならば、あなたはそれをCustomReflectableに準拠させてあつらえのMirrorを返すことができます。

source: You can create an empty array by specifying the Element type of your array in the declaration.
ja: あなたは空の配列を、あなたの配列のElement型をその宣言において指定することで作成することができます。

source: You can create new instances of a type that conforms to the BinaryInteger protocol from a floating-point number or another binary integer of any type.
ja: あなたは、ある型の新しいインスタンスでBinaryIntegerプロトコルに準拠するものを、浮動小数点数またはどんな型であれ別のバイナリ整数から作成できます。

source: You can create your own singletons as a way to provide a unified access point to a resource or service that’s shared across an app, like an audio channel to play sound effects or a network manager to make HTTP requests.
ja: あなたは、サウンドエフェクトを再生するオーディオチャンネルやHTTPリクエストを行うネットワークマネージャのような、あるアプリ全体で共有されるリソースやサービスへの一本化されたアクセスポイントを提供する方法として、あなた自身のシングルトンを作成します。

source: You can decompose the tuple in a for-in loop, which calls makeIterator() behind the scenes, or when calling the iterator’s next() method directly.
ja: あなたはこのタプルを分解することが、makeIterator()を各場面の裏側で呼ぶfor-in ループにおいて、またはイテレータの持つnext()メソッドを直に呼び出すときに行えます。

source: You can expect faster execution when the collections share many common elements, or if Element conforms to Hashable.
ja: あなたはより速い遂行を予想できます、コレクションそれらが多くの普通の要素を共有する場合は、またはもしElementがHashableに準拠するならば。

source: You can expect faster execution when the collections share many common elements.
ja: あなたはより速い遂行を予想できます、コレクションそれらが多くの普通の要素を共有する場合は。

source: You can feed data to the hasher using a series of calls to mutating combine methods.
ja: あなたは、データをハーシャーに送り込むのに、一連の変更combineメソッド呼び出しを使います。

source: You can find a complete set of a collection’s valid indices by starting with the collection’s startIndex property and finding every successor up to, and including, the endIndex property.
ja: あなたはコレクションの有効なインデックスの完全な一揃いを見つけることが、そのコレクションのstartIndexプロパティで開始して、すべての後に続くものをendIndexプロパティまで、それを含めて、見つけ出すことによって行えます。

source: You can initialize a variable of any of these types using a string literal that holds a single Unicode scalar.
ja: あなたは、これらのいずれかの型の変数を初期化することが、単一のユニコードスカラーを保持する文字列リテラルを使って行えます。

source: You can initialize a variable or constant of any of these types by assigning a floating-point literal.
ja: あなたは、これらの型どれかの変数または定数を、浮動小数点リテラルを割り当てることによって初期化できます。

source: You can initialize a variable or constant of any of these types by assigning an integer literal.
ja: あなたは、それらの型のどれかの変数や定数を初期化することが、整数リテラルを割り当てることによって可能です。

source: You can initialize a variable or constant of any of these types using a string literal that holds a single character.
ja: あなたは、これらの型のどれかの変数または定数を、単一の文字を保持する文字列リテラルを使って初期化できます。

source: You can initialize a variable or constant of either of these types using a string literal of any length.
ja: あなたは、それらの型のいずれかの変数や定数を初期化することが随意の長さの文字列リテラルを使って行えます。

source: You can iterate over a dictionary using a for-in loop, decomposing each key-value pair into the elements of a tuple.
ja: あなたは辞書全体にわたって反復適用していくことが、for-inループを使うことで、各キー値ペアをタプルの要素へと分解しながら可能です。

source: You can make many custom types equatable and hashable by simply declaring these protocol conformances in the same file as the type's original declaration.
ja: あなたは、多くのあつらえの型をequatableおよびhashableにすることが、単にそれらプロトコル準拠をその型の原型の宣言と同じファイルにおいて宣言することによって行えます。

source: You can only use key-value observing with classes that inherit from NSObject.
ja: あなたはキー値監視を、NSObjectから継承するクラスでのみ使うことができます。

source: You can pass only valid indices to collection operations.
ja: あなたは有効なインデックスだけをコレクション演算子に渡せます。

source: You can pass zero or more items to the debugPrint(_:separator:terminator:) function.
ja: あなたは、ゼロ個以上の項目をdebugPrint(_:separator:terminator:)関数に渡すことができます。

source: You can pass zero or more items to the debugPrint(_:separator:terminator:to:) function.
ja: あなたは、ゼロ個以上の項目をdebugPrint(_:separator:terminator:to:)関数に渡すことができます。

source: You can pass zero or more items to the print(_:separator:terminator:) function.
ja: あなたは、ゼロ個以上の項目をprint(_:separator:terminator:)関数に渡すことができます。

source: You can pass zero or more items to the print(_:separator:terminator:to:) function.
ja: あなたは、ゼロ個以上の項目をprint(_:separator:terminator:to:)関数に渡すことができます。

source: You can rely on automatic synthesis of the Equatable protocol’s requirements for a custom type when you declare Equatable conformance in the type’s original declaration and your type meets these criteria:
ja: あなたはEquatableプロトコルの要件の自動合成をあつらえの型のために当てにすることが、あなたがEquatable準拠をその型のもつ元々の宣言において宣言してあなたの型がそれらの基準に沿う場合に可能です。

source: You can replace an existing element with a new value by assigning the new value to the subscript.
ja: あなたは、既存の要素を新しい値で置き換えることが、新しい値をその添え字に代入することで行えます。

source: You can retrieve the same slice using the string’s ranged subscript, which takes a range expression.
ja: あなたは、同じスライスを文字列の範囲指定された添え字を使って取って来ることができます、それは範囲式をとっています。

source: You can reverse a collection without allocating new space for its elements by calling this reversed() method.
ja: あなたは、あるコレクションを逆順にすることがそれの要素に対して新しい空間を割り当てることなくreversed()メソッドによって可能です。

source: You can search a dictionary’s contents for a particular value using the contains(where:) or firstIndex(where:) methods supplied by default implementation.
ja: あなたは、ある特定の値を求めて辞書の持つ内容を検索することが、省略時の実装で提供されるcontains(where:)またはfirstIndex(where:)メソッドを使って可能です。

source: You can sort any mutable collection of elements that conform to the Comparable protocol by calling this method.
ja: あなたはComparableプロトコルに準拠する要素からなるあらゆる可変の配列をこのメソッドを呼び出すことによってソートできます。

source: You can sort any sequence of elements that conform to the Comparable protocol by calling this method.
ja: あなたはいくらかの要素からなる何らかのシーケンスでComparableプロトコルに準拠するものをこのメソッドを呼び出すことによってソートする（並び替える）ことができます。

source: You can store indices in variables, and pass them to collection algorithms or use them later to access the corresponding element.
ja: あなたはこのようなインデックスを変数に格納して、それらを幾つかあるコレクションアルゴリズムに渡すことや、相当する要素にアクセスするためにそれらを後で使うことができます。

source: You can store mixed-type keys in dictionaries and other collections that require Hashable conformance by wrapping mixed-type keys in AnyHashable instances:
ja: あなたは混成型のキーを様々な辞書や他のコレクションに格納できます、それらは混成型キーをAnyHashableインスタンスの中へのラップするHashable準拠を必要とします：

source: You can subscript a collection with any valid index other than the collection’s end index.
ja: あなたは、そのコレクションの末尾インデックスの以外のあらゆる有効なインデックスで、コレクションに対して添え字を使うことができます。

source: You can subscript an array with any integer from zero up to, but not including, the count of the array.
ja: あなたは、ゼロから配列の総数まで、しかしそれを含めず、任意の整数で添え字を使うことができます。

source: You can take advantage of this compiler support when defining your own custom enumeration by declaring conformance to CaseIterable in the enumeration’s original declaration.
ja: あなたはこのコンパイラサポートを、あなた独自のあつらえの列挙をCaseIterableへの準拠をその列挙の元の宣言において宣言することによって定義する場合に利用できます。

source: You can use AnyIterator to hide the type signature of a more complex iterator.
ja: あなたはAnyIteratorを使って、あるより複雑なイテレータの型シグネチャを隠すことができます。

source: You can use popLast() to remove the last element of a collection that might be empty.
ja: あなたはpopLast()を使って、空であるかもしれないコレクションの最後の要素を削除できます。

source: You can use stride(from:through:by:) to create a sequence that strides upward or downward.
ja: あなたは、stride(from:through:by:)を使って上向きまたは下向きにまたいで越えるシーケンスを作成できます。

source: You can use stride(from:to:by:) to create a sequence that strides upward or downward.
ja: あなたは、stride(from:to:by:)を使って上向きまたは下向きにまたいで越えるシーケンスを作成できます。

source: You can use == to check for equality between any two instances or call the Equatable-constrained contains(_:) method.
ja: あなたは==を使って何でも２つのインスタンス間の同等性を調べたり、Equatable制約のcontains(_:)メソッドを呼び出すことができます。

source: You can use Objective-C and Swift files together in a single project, no matter which language the project used originally.
ja: あなたはObjective-CおよびSwiftファイルを一緒にしてある単一のプロジェクトの中で使うことができます、どちらの言語をそのプロジェクトが最初に使用しようとも。

source: You can use a CollectionOfOne instance when you need to efficiently represent a single value as a collection.
ja: あなたは、CollectionOfOneインスタンスを、あなたが単一の値をコレクションとして効率的に表す必要がある場合に使えます。

source: You can use an array literal anywhere an instance of an ExpressibleByArrayLiteral type is expected: as a value assigned to a variable or constant, as a parameter to a method or initializer, or even as the subject of a nonmutating operation like map(_:) or filter(_:).
ja: あなたは配列リテラルをExpressibleByArrayLiteral型が予期されるところはどこででも使うことができます：変数や定数に割り当てられる値として、メソッドやイニシャライザへのパラメータとして、またはmap(_:)やfilter(_:)のような非変更の操作のサブジェクトとしてさえも。

source: You can use any type that conforms to the Hashable protocol in a set or as a dictionary key.
ja: あなたはHashableプロトコルに準拠するあらゆる型を集合においてまたは辞書キーとして使うことができます。

source: You can use optional chaining to call the @objc method getIntegerValue() on obj safely.
ja: あなたは、オプショナル連鎖を使って、@objcメソッドgetIntegerValue()をobj上で安全に呼び出すことができます。

source: You can use relational operators, such as the less-than and equal-to operators (< and ==), to compare instances of different binary integer types.
ja: あなたは、関係演算子、例えばより小さいそして同等演算子（<そして==）などを使って、異なるバイナリ整数型のインスタンス同士を比較できます。

source: You can use special versions of some sequence and collection operations when working with a Comparable type.
ja: あなたは、特別版のなんらかのシーケンスやコレクション演算をあるComparable型を扱うときに使用できます。

source: You can use the AnyClass protocol as the concrete type for an instance of any class.
ja: あなたはAnyClassプロトコルをあらゆるクラスのインスタンスに対して具象型として使うことができます。

source: You can use the relative(to:) method to convert a range expression, which could be missing one or both of its endpoints, into a concrete range that is bounded on both sides.
ja: あなたは、relative(to:)メソッドを使うことによって、それの端点の両方または１つを抜かすことができる範囲式を、両方の側で閉ざされた具体的な範囲へと変換できます。
